
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA01.
      *===========================================
      *== AUTOR: JOSAFA; EMPRESA: XPTO
      *==OBJETIVO: 1º CONTATO COM COBOL
      *==DATA XX/XX/2024
      *==OBSERVACOES:
      *===========================================

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            DISPLAY "Hello World 2"
            STOP RUN.
       END PROGRAM PROGRAMA01.
